 1. Create a Pandas Series from the list [10, 20, 30, 40, 50]. Print the Series, its index, and data type. Then create a DataFrame with columns "Name", "Age", and "City" containing at least 4 rows of data.

In [1]:
import pandas as pd

In [6]:
num = [10, 20, 30, 40, 50]

s = pd.Series(num)
print(s)
print(s.index)
print(s.dtype)

0    10
1    20
2    30
3    40
4    50
dtype: int64
RangeIndex(start=0, stop=5, step=1)
int64

In [8]:
data = {
    "Name": ["Rahim", "Karim", "Salam", "Fatima"],
    "Age": [10, 15, 12, 18],
    "City": ["Dhaka", "Chittagong", "Khulna", "Rajshahi"]
}

In [9]:
df = pd.DataFrame(data)
df

     Name  Age        City
0   Rahim   10       Dhaka
1   Karim   15  Chittagong
2   Salam   12      Khulna
3  Fatima   18    Rajshahi

2. Using any DataFrame, write code to print the number of rows and columns, column data types (.dtypes), and summary statistics (.describe()).

In [12]:
df.shape[0]

4

In [13]:
df.shape[1]

3

In [14]:
df.dtypes

Name    object
Age      int64
City    object
dtype: object

In [15]:
df.describe()

         Age
count   4.00
mean   13.75
std     3.50
min    10.00
25%    11.50
50%    13.50
75%    15.75
max    18.00

3. Create a DataFrame using the dictionary below:


data = {
    'Product': ['Pen', 'Book', 'Eraser', 'Pencil'],
    'Price': [10, 50, 5, 7],
    'Quantity': [100, 60, 200, 150]
}

Print .columns, .index. Access a single column and one full row.

In [17]:
data = {
    'Product': ['Pen', 'Book', 'Eraser', 'Pencil'],
    'Price': [10, 50, 5, 7],
    'Quantity': [100, 60, 200, 150]
}
df = pd.DataFrame(data)
df

  Product  Price  Quantity
0     Pen     10       100
1    Book     50        60
2  Eraser      5       200
3  Pencil      7       150

In [18]:
df.columns

Index(['Product', 'Price', 'Quantity'], dtype='object')

In [19]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [20]:
df['Price']

0    10
1    50
2     5
3     7
Name: Price, dtype: int64

In [21]:
df['Product']

0       Pen
1      Book
2    Eraser
3    Pencil
Name: Product, dtype: object

In [24]:
df.iloc[2]

Product     Eraser
Price            5
Quantity       200
Name: 2, dtype: object

4. Using .loc[] and .iloc[], show the first row, the second column, and a 2×2 block    from the middle of your DataFrame.

In [25]:
df.loc[0]

Product     Pen
Price        10
Quantity    100
Name: 0, dtype: object

In [26]:
df.iloc[0]

Product     Pen
Price        10
Quantity    100
Name: 0, dtype: object

In [27]:
df.iloc[:,1]

0    10
1    50
2     5
3     7
Name: Price, dtype: int64

In [28]:
df.iloc[1:3,1:3]

   Price  Quantity
1     50        60
2      5       200

5. Create a 4×3 DataFrame of student names and marks. Drop one column using .drop(), drop one row by index

In [30]:
# একটি 4×3 DataFrame তৈরি করি
data = {
    'Name': ['Rahim', 'Karim', 'Salam', 'Fatima'],
    'Math': [85, 90, 78, 92],
    'Science': [80, 85, 88, 90],
    'English': [75, 80, 82, 85]
}

df = pd.DataFrame(data)
df

     Name  Math  Science  English
0   Rahim    85       80       75
1   Karim    90       85       80
2   Salam    78       88       82
3  Fatima    92       90       85

In [32]:
# 2. একটি কলাম বাদ দেওয়া ('Science')
drop_s = df.drop(columns='Science')
drop_s

     Name  Math  English
0   Rahim    85       75
1   Karim    90       80
2   Salam    78       82
3  Fatima    92       85

In [34]:
# 3. একটি রো বাদ দেওয়া (1 নম্বর রো)
drop_row = df.drop(index=0)
drop_row

     Name  Math  Science  English
1   Karim    90       85       80
2   Salam    78       88       82
3  Fatima    92       90       85

6. Create a DataFrame of employees with columns "Name", "Department", and "Salary". Sort it by "Salary" in ascending order and by "Name" in descending order.

In [35]:
# কর্মচারীদের ডেটা
data = {
    'Name': ['Rahim', 'Karim', 'Salam', 'Fatima', 'Anika'],
    'Department': ['HR', 'IT', 'Finance', 'IT', 'HR'],
    'Salary': [50000, 70000, 60000, 65000, 55000]
}

df = pd.DataFrame(data)
df

     Name Department  Salary
0   Rahim         HR   50000
1   Karim         IT   70000
2   Salam    Finance   60000
3  Fatima         IT   65000
4   Anika         HR   55000

In [40]:
# 2. Salary অনুযায়ী ছোট থেকে বড় সাজানো
sort_sa = df.sort_values(by='Salary')
sort_sa

     Name Department  Salary
0   Rahim         HR   50000
4   Anika         HR   55000
2   Salam    Finance   60000
3  Fatima         IT   65000
1   Karim         IT   70000

In [41]:
# 3. Name অনুযায়ী বড় থেকে ছোট সাজানো
sort_name = df.sort_values(by='Name', ascending=False)
sort_name

     Name Department  Salary
2   Salam    Finance   60000
0   Rahim         HR   50000
1   Karim         IT   70000
3  Fatima         IT   65000
4   Anika         HR   55000

7. Create a DataFrame of 8 students with columns "Name" and "Score". Filter and print students with Score > 60 and those with Score < 40.

In [42]:
# 8 জন ছাত্রের ডেটা
data = {
    'Name': ['Rahim', 'Karim', 'Salam', 'Fatima', 'Anika', 'Tania', 'Mizan', 'Nusrat'],
    'Score': [85, 30, 75, 90, 35, 65, 20, 95]
}

df = pd.DataFrame(data)
df

     Name  Score
0   Rahim     85
1   Karim     30
2   Salam     75
3  Fatima     90
4   Anika     35
5   Tania     65
6   Mizan     20
7  Nusrat     95

In [43]:
hig = df[df['Score'] > 60]
hig

     Name  Score
0   Rahim     85
2   Salam     75
3  Fatima     90
5   Tania     65
7  Nusrat     95

In [44]:
low = df[df['Score']< 40]
low

    Name  Score
1  Karim     30
4  Anika     35
6  Mizan     20